server/performance/tests/centers.yml
# ==============================================================================
# tests/centers.yml — Performance tests for Health Center routes
# Route file : server/src/routes/doctorChanneling/center.routes.js
# Base URL   : http://localhost:8081
# Mounted at : /api/centers
# ==============================================================================
#
# Run this test:
#   npx artillery run server/performance/tests/centers.yml
# ==============================================================================

config:
  target: "http://localhost:5000"

  defaults:
    headers:
      Content-Type: "application/json"
      Accept: "application/json"

  variables:
    centerId: "REPLACE_WITH_REAL_CENTER_ID"

  phases:
    - name: "Warm-up"
      duration: 10
      arrivalRate: 3

    - name: "Ramp-up"
      duration: 30
      arrivalRate: 3
      rampTo: 30

    - name: "Sustained load"
      duration: 60
      arrivalRate: 30

  plugins:
    metrics-by-endpoint: {}

scenarios:
  # ============================================================================
  # SCENARIO 1 — List all health centers
  # Patients browse centers before choosing a doctor.
  # One of the most-hit public endpoints → highest weight.
  # ============================================================================
  - name: "List all health centers"
    weight: 5
    flow:
      # GET /api/centers
      - get:
          url: "/api/centers"
          expect:
            - statusCode: 200

  # ============================================================================
  # SCENARIO 2 — Get a single center by ID
  # Patient views a specific center's details/contact/hours.
  # ============================================================================
  - name: "Get a single health center"
    weight: 3
    flow:
      # GET /api/centers/:id
      - get:
          url: "/api/centers/{{ centerId }}"
          expect:
            - statusCode: 200