server/performance/tests/doctors.yml
# ==============================================================================
# tests/doctors.yml — Performance tests for Doctor routes
# Route file : server/src/routes/doctorChanneling/doctor.routes.js
# Base URL   : http://localhost:8081
# Endpoints tested:
#   GET  /api/doctors           → List all doctors (public, paginated)
#   GET  /api/doctors/:id       → Get single doctor by Mongo ObjectId (public)
#   GET  /api/slots             → Get available slots for a doctor on a date
# ==============================================================================
#
# Run this test:
#   npx artillery run server/performance/tests/doctors.yml
#
# TIP: Replace the doctorId and slotDate variables below with real values
#      from your seeded database before running.
# ==============================================================================

config:
  target: "http://localhost:5000"

  defaults:
    headers:
      Content-Type: "application/json"
      Accept: "application/json"

  # These top-level variables are accessible in all scenarios as {{ varName }}.
  # Update these with real IDs from your database.
  variables:
    # A real doctor MongoDB ObjectId from your database
    doctorId: "REPLACE_WITH_REAL_DOCTOR_ID"
    # A date in YYYY-MM-DD format that has available slots
    slotDate: "2026-04-01"

  phases:
    # GET (read) endpoints handle much higher concurrency than writes.
    - name: "Warm-up"
      duration: 15
      arrivalRate: 5

    - name: "Ramp-up"
      duration: 40
      arrivalRate: 5
      rampTo: 50    # push to 50 concurrent arrivals/sec

    - name: "Sustained load"
      duration: 60
      arrivalRate: 50

  plugins:
    metrics-by-endpoint: {}

scenarios:
  # ============================================================================
  # SCENARIO 1 — List all doctors
  # Simulates a patient browsing the doctor directory.
  # This is likely the highest-traffic read endpoint — weight it accordingly.
  # ============================================================================
  - name: "List all doctors (public browse)"
    weight: 4    # 4 / (4+3+3) = ~40 % of virtual users
    flow:
      # GET /api/doctors
      # No auth required — this is a public listing endpoint.
      - get:
          url: "/api/doctors"
          expect:
            - statusCode: 200

  # ============================================================================
  # SCENARIO 2 — Get a specific doctor by ID
  # Simulates clicking on a doctor card to see their profile.
  # ============================================================================
  - name: "Get doctor by ID"
    weight: 3    # ~30 % of virtual users
    flow:
      # GET /api/doctors/:id
      # {{ doctorId }} is substituted from config.variables above.
      - get:
          url: "/api/doctors/{{ doctorId }}"
          expect:
            - statusCode: 200

  # ============================================================================
  # SCENARIO 3 — Get available slots for a doctor on a given date
  # This hits GET /api/slots?doctorId=...&date=... which queries the Slot model.
  # Useful for measuring DB query performance under load.
  # ============================================================================
  - name: "Fetch available appointment slots"
    weight: 3    # ~30 % of virtual users
    flow:
      # GET /api/slots?doctorId=...&date=...
      # Query parameters are embedded directly in the url string.
      - get:
          url: "/api/slots?doctorId={{ doctorId }}&date={{ slotDate }}"
          expect:
            - statusCode: 200