server/performance/tests/pharmacy.yml
# ==============================================================================
# tests/pharmacy.yml — Performance tests for Pharmacy routes
# Route files:
#   server/src/routes/pharmacy/medicationInventoryRoutes.js
#   server/src/routes/pharmacy/pharmacyOrderRoutes.js
#
# NOTE: Pharmacy routes are NOT currently mounted in server.js.
#       Before running this test you need to add these two lines to server.js:
#
#         const medicationRoutes = require("./routes/pharmacy/medicationInventoryRoutes");
#         const pharmacyOrderRoutes = require("./routes/pharmacy/pharmacyOrderRoutes");
#         app.use("/api/medications", medicationRoutes);
#         app.use("/api/pharmacy-orders", pharmacyOrderRoutes);
#
# Endpoints tested:
#   GET  /api/medications           → List all medications (inventory browse)
#   GET  /api/medications/test      → Health-check route
#   POST /api/medications           → Add new medication to inventory
#   GET  /api/pharmacy-orders       → List all pharmacy orders
#   POST /api/pharmacy-orders       → Create a new pharmacy order
# ==============================================================================
#
# Run this test:
#   npx artillery run server/performance/tests/pharmacy.yml
# ==============================================================================

config:
  target: "http://localhost:5000"

  defaults:
    headers:
      Content-Type: "application/json"
      Accept: "application/json"

  variables:
    medicationId: "REPLACE_WITH_REAL_MEDICATION_ID"
    orderId: "REPLACE_WITH_REAL_ORDER_ID"

  phases:
    - name: "Warm-up"
      duration: 10
      arrivalRate: 3

    - name: "Ramp-up"
      duration: 30
      arrivalRate: 3
      rampTo: 20

    - name: "Sustained load"
      duration: 60
      arrivalRate: 20

  plugins:
    metrics-by-endpoint: {}

scenarios:
  # ============================================================================
  # SCENARIO 1 — Medication inventory health-check
  # Verifies the route is alive before running heavier scenarios.
  # ============================================================================
  - name: "Medication inventory health-check"
    weight: 1
    flow:
      # GET /api/medications/test
      - get:
          url: "/api/medications/test"
          expect:
            - statusCode: 200

  # ============================================================================
  # SCENARIO 2 — List all medications
  # Pharmacist browsing the full inventory.
  # High-frequency read — largest weight.
  # ============================================================================
  - name: "List all medications"
    weight: 5
    flow:
      # GET /api/medications
      - get:
          url: "/api/medications"
          expect:
            - statusCode: 200

  # ============================================================================
  # SCENARIO 3 — Create a new medication entry
  # Tests the DB insert path for new stock items.
  # {{ $randomString() }} creates a unique name per virtual-user run.
  # ============================================================================
  - name: "Add new medication to inventory"
    weight: 1
    flow:
      # POST /api/medications
      - post:
          url: "/api/medications"
          json:
            # Adjust these fields to match your Medication Mongoose schema
            name: "PerfDrug_{{ $randomString() }}"
            category: "Antibiotic"
            unit: "Tablet"
            reorderLevel: 50
          expect:
            - statusCode:
                - 200
                - 201

  # ============================================================================
  # SCENARIO 4 — List all pharmacy orders
  # Pharmacist viewing pending/completed orders.
  # ============================================================================
  - name: "List all pharmacy orders"
    weight: 4
    flow:
      # GET /api/pharmacy-orders
      - get:
          url: "/api/pharmacy-orders"
          expect:
            - statusCode: 200

  # ============================================================================
  # SCENARIO 5 — Create a pharmacy order
  # Tests the full order-creation + stock-deduction write path.
  # Keep weight low — modifies inventory data.
  # ============================================================================
  - name: "Create a pharmacy order"
    weight: 1
    flow:
      # POST /api/pharmacy-orders
      - post:
          url: "/api/pharmacy-orders"
          json:
            # Adjust fields to match your PharmacyOrder Mongoose schema
            patientId: "REPLACE_WITH_REAL_PATIENT_ID"
            items:
              - medicationId: "{{ medicationId }}"
                quantity: 2
            notes: "Performance test order"
          expect:
            - statusCode:
                - 200
                - 201